app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users" ORDER BY created_at DESC
---
  def index
    @users = User.all.order('created_at DESC')