app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."deadline" DESC LIMIT $1 OFFSET $2  [["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "tasks"
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."priority" DESC LIMIT $1 OFFSET $2  [["LIMIT", 4], ["OFFSET", 0]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."statut" = $1 LIMIT $2 OFFSET $3  [["statut", "0"], ["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."statut" = $1  [["statut", "0"]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."name" = $1 AND "tasks"."statut" = $2 LIMIT $3 OFFSET $4  [["name", "wilfried"], ["statut", "0"], ["LIMIT", 4], ["OFFSET", 0]]
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 4], ["OFFSET", 0]]
---
    def index

      #@statut = params[:statu].to_i
      if params[:sort_expired]
        @tasks=Task.all.order(deadline: :desc).page(params[:page]).per(4)
      elsif params[:sort_priority]
        @tasks=Task.all.order(priority: :desc).page(params[:page]).per(4)
      elsif params[:name].blank? && params[:statut]
        @tasks = Task.where(statut:params[:statut]).page(params[:page]).per(4)
      elsif params[:name] && params[:statut]
        @tasks = Task.where(name: params[:name]).where(statut:params[:statut]).page(params[:page]).per(4)
      else
        @tasks=Task.all.order(created_at: :desc).page(params[:page]).per(4)

INSERT INTO "tasks" ("name", "content", "end_time", "created_at", "updated_at", "statut", "priority") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "rose"], ["content", "content"], ["end_time", "2020-10-01"], ["created_at", "2020-09-30 16:44:37.292799"], ["updated_at", "2020-09-30 16:44:37.292799"], ["statut", 0], ["priority", 0]]
---
    def create
      @task = Task.new(task_params)
      if @task.save

UPDATE "tasks" SET "detail" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["detail", "tontontotonto toiiii"], ["updated_at", "2020-09-26 20:20:56.873229"], ["id", 13]]
---
    def update
      if @task.update(task_params)

DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 10]]
---
    def destroy
      @task.destroy

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def set_task
      @task = Task.find(params[:id])